<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Tipos de amea&ccedil;as</title>
    <link rel="icon" href="images/favicon.jpeg">

    <!-- Bootstrap v5.3 navbar -->
    <link rel="canonical" href="https://getbootstrap.com/docs/5.3/examples/headers/">
    <!-- Bootstrap stylesheet -->
    <link rel="stylesheet" href="css/bootstrap-header.min.css">
    <!-- jQuery library -->
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.3/jquery.min.js"></script>
    <!-- Bootstrap JavaScript -->
    <script src="http://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>
    <script src="js/bootstrap.bundle.min.js"></script>
    <!-- Personal Styles -->
    <link rel="stylesheet" href="css/style.css">

    <!-- Bootstrap minified CSS -->
<!--    <link rel="stylesheet" href="http://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css">-->
    <!-- Optional theme -->
<!--    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap-theme.min.css">-->
</head>
<body>
<nav class="p-3 text-bg-dark">
    <div class="container">
        <div class="d-flex flex-wrap align-items-center justify-content-center justify-content-lg-start">
            <ul class="nav col-12 col-lg-auto me-lg-auto mb-2 justify-content-center mb-md-0">
                <li><a href="index.html" class="nav-link px-2 text-white">In&iacute;cio</a></li>
                <li>
                    <div class="flex-shrink-0 dropdown">
                        <a href="#"  class="nav-link px-2 text-secondary dropdown-toggle" data-bs-toggle="dropdown" aria-expanded="false">
                            Amea&ccedil;as
                        </a>
                        <ul class="dropdown-menu text-small shadow">
                            <li><a class="dropdown-item" href="ameacas.html">Topo da p&aacute;gina</a></li>
                            <li><hr class="dropdown-divider"></li>
                            <li><a class="dropdown-item" href="ameacas.html#ameacas-ciberneticas">Amea&ccedil;as Cibernéticas</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#guerras-ciberneticas">Guerras Cibernéticas</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#internet-banking">Internet Banking</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#mobile-malware">Mobile Malware</a></li>
                        </ul>
                    </div>
                </li>
                <li>
                    <div class="flex-shrink-0 dropdown">
                        <a href="#"  class="nav-link px-2 text-white dropdown-toggle" data-bs-toggle="dropdown" aria-expanded="false">
                            Vulnerabilidades
                        </a>
                        <ul class="dropdown-menu text-small shadow">
                            <li><a class="dropdown-item" href="vulnerabilidades.html">Topo da p&aacute;gina</a></li>
                            <li><hr class="dropdown-divider"></li>
                            <li><a class="dropdown-item" href="vulnerabilidades.html#analise-de-vulnerabilidades">An&aacute;lise de vulnerabilidades</a></li>
                            <li><a class="dropdown-item" href="vulnerabilidades.html#analise-de-evidencias">An&aacute;lise de evidências</a></li>
                        </ul>
                    </div>
                </li>
                <li><a href="solucoes.html" class="nav-link px-2 text-white">Solu&ccedil;&otilde;es de seguran&ccedil;a</a></li>
            </ul>

            <div class="text-end">
                <button class="btn btn-warning"> <a class="btn btn-warning" href="about.html" target="_blank"> About </a></button>
            </div>
        </div>
    </div>
</nav>
<div class="container body-content shadow">
    <h1 id="tipos-de-ameacas" class="page-title">Tipos de Amea&ccedil;as Cibernéticas</h1>
    <hr>

    <h1 id="ameacas-ciberneticas">Amea&ccedil;as Cibern&eacute;ticas</h1>
    <p>
        Conjunto de <i>malware</i> e <i>software</i> com capacidade de afetar o funcionamento normal de equipamentos digitais. Muitas vezes usadas para ciberterrorismo e causar danos graves com o intuito de lucrar ou impossibilitar o trabalho usual de uma entidade.
    </p>
    <h2 id="botnets">Botnets</h2>
    <p>
        Botnets s&atilde;o robos digitais que conseguem infetar dispositivos tal como um v&iacute;rus e a partir de a&iacute; permitir que utilizadores remotos tenham acesso &agrave; m&aacute;quina onde se encontram alojados. Estas m&aacute;quinas s&atilde;o muitas vezes usadas para realizar tarefas il&iacute;citas e ilegais por parte do utilizador remoto sem este ser exposto por n&atilde;o ser a m&aacute;quina do mesmo a realizar as a&ccedil;&otilde;es.
    </p>
    <p>
        Estes botnets podem contaminar computadores, dispositivos m&oacute;veis, <i>routers</i> e dispositivos IOT (Internet of Things).
    </p>
    <p>
        Da mesma maneira que um v&iacute;rus tenta infetar o corpo humano por falhas no sistema imunit&aacute;rio, tamb&eacute;m estes <i>bots</i> tentam infetar os dispositivos atrav&eacute;s de falhas de seguran&ccedil;a. &eacute; poss&iacute;vel detetar que o dispositivo se encontra infetado a partir da dete&ccedil;&atilde;o de comportamentos anormais por parte da m&aacute;quina, por exemplo, quando esta trabalha de forma mais lenta do que o normal ou quando durante a utiliza&ccedil;&atilde;o aparecem mensagens de erro aleat&oacute;rias.
    </p>
    <h4>Tipos de Botnets</h4>
    <p>Dentro dos botnets existem dois tipos: Cliente Servidor e Peer-to-Peer</p>
    <ul>
        <li><b>Cliente Servidor: </b>Este &eacute; o modelo dos botnets mais antigos em que os dispositivos infetados (clientes) recebem intru&ccedil;&otilde;es de outro dispositivo que os controla (servidor)</li>
        <li><b>Peer-to-peer: </b> Este modelo corrige algumas falhas que o modelo de cliente servidor tinha. Em vez de ser establecida apenas uma conex&atilde;o entre dois dispositivos (cliente e servidor), neste modelo todos os dispositivos infetados est&atilde;o conectados entre si, todos a ser controlados pelo mesmo dispositivo que d&aacute; as intru&ccedil;&otilde;es a todos os outros. Isto permite que no caso de haver uma falha com um dos dispositivos infetados, a rede continue <i>online</i> e funcional.</li>
    </ul>
    <h2 id="ddos">DDoS</h2>
    <p>
        Estas amea&ccedil;as s&atilde;o das mais comuns e mais utilizadas pela comunidade de atacantes. O objetivo destes ataques &eacute; levar o consumo de recursos do servidor/aplica&ccedil;&atilde;o ao limite. Uma vez sem recursos disponiveis, o servidor acaba por ter falhas de funcionalidade ou pode chegar mesmo a ir abaixo, ficando offine. A quantidade deste genero de ataques t&ecirc;m aumentado substancialmente, segundo a Microsoft, a Azure Networking registou, em 2021, um aumento de 25% a mais de casos de DDoS em rela&ccedil;&atilde;o a 2020.
    </p>
    <h4>Funcionamento de DDoS</h4>
    <p>
        Durante estes ataques, um conjunto de <a href="#botnets">Botnets</a> ataca uma aplica&ccedil;&atilde;o/servidor visando desgastar e levar o consumo de recursos ao limite. Fazem isto procedendo ao uso exagerado de solicita&ccedil;&otilde;es Hypertext Transfer Protocol (HTTP). Visto que os atacantes usam estes <i>bots</i>, conseguem tamb&eacute;m acesso &agrave; base de dados, podendo conseguir roubar informa&ccedil;&atilde;o sensivel e, visto que os recursos do servidor j&aacute; est&atilde;o no limite, os propriet&aacute;rios e respons&aacute;veis pela seguran&ccedil;a do servidor t&ecirc;m dificuldade na defesa do seu sistema. Estes ataques podem demorar diversos intervalos de tempo, desde minutos at&eacute; mesmo dias.
    </p>
    <h4>Tipos de ataques DDoS</h4>
    <ul>
        <li><b>Ataque volum&eacute;trico: </b>estes ataques baseam-se na sobrecarga do servidor com tr&aacute;fego, sendo o tipo de ataque mais comum.</li>
        <li><b>Ataque de protocolo: </b>estes ataques atacam certas camadas de protocolos de seguran&ccedil;a eliminando limites de tr&aacute;fego permitindo uma mais f&aacute;cil sobrecarga dos recursos.</li>
        <li><b>Ataque a camada de recursos: </b>estes ataques s&atilde;o usados principalmente em redes de servidores, pois permitem o bloqueio na troca de informa&ccedil;&atilde;o entre os diversos hospedeiros.</li>
    </ul>
    <p>
        Durante um ataque DDoS podem ser usados apenas um ou mais destes tipos, muitas vezes come&ccedil;a como um dos tipos para debilitar os sistemas de seguran&ccedil;a para que depois possam ser usados ataques de exaust&atilde;o do sistema.
    </p>
    <hr>
    <h1 id="guerras-ciberneticas">Guerras Cibern&eacute;ticas</h1>
    <p>Por vezes estas amea&ccedil;as e armas cibern&eacute;ticas s&atilde;o usadas para criar guerras. Estas s&atilde;o muito prejudiciais para as v&iacute;timas da guerra, mas benificial para o atacante, pois este consegue muitas vezes vencer a guerra sem qualquer custo para si, mas leva a s&eacute;rios danos &agrave; v&iacute;tima, explorando falhas de seguran&ccedil;a nos seus sistemas.</p>
    <p>As v&iacute;timas s&atilde;o muitas vezes pa&iacute;ses ou empresas e n&atilde;o entidades pequenas, atacados n&atilde;o apenas dados das entidades mas tamb&eacute;m os pr&oacute;prios sistemas, levando ao corrompimento de parte do functionamento da entidade.</p>
    <p>Estas guerras s&atilde;o tamb&eacute;m usadas no roubo de informa&ccedil;&atilde;o desde dados simples at&eacute; mesmo dados banc&aacute;rios ou na espionagem de dados militares, ou diplom&aacute;ticos. Outro uso dado a estas guerras &eacute; a corrup&ccedil;&atilde;o e a manipula&ccedil;&atilde;o de dados para benificio de uma certa entidade como acontece em algumas disputas de poder.</p>
    <p>Exixtem duas formas de guerras: <a href="#war-arc">ARC</a> e <a href="#war-erc">ERC</a>.</p>
    <h2 id="war-arc">ARC</h2>
    <p>
        Estas guerras s&atilde;o respons&aacute;veis pela destrui&ccedil;&atilde;o e degrada&ccedil;&atilde;o de redes e da informa&ccedil;&atilde;o com a qual estas trabalham. Podem ser usados DDoS para provocar sobrecarga no servidor fazendo pedidos de informa&ccedil;&atilde;o de quantidade superior &agrave; que o servidor aguenta ou podem-se criar bloqueios nos servidores para impedir o acesso aos mesmos por parte dos utilizadores.
    </p>
    <h2 id="war-erc">ERC</h2>
    <p>
        Estas guerras s&atilde;o as respons&aacute;veis pelo espionamento de entidades e por vezes provocar danos colaterais na rede durante o processo.
    </p>
    <hr>
    <h1 id="internet-banking">Internet Banking</h1>
    <p>
        Tal como o nome sugere estas amea&ccedil;as procuram tirar proveito de falhas em sistemas banc&aacute;rios quer bancos financeiros, quer bancos de dados. Com a explora&ccedil;&atilde;o de vulnerabilidades nestes bancos, o atacante consegue um grande acesso &agrave; informa&ccedil;&atilde;o dos utilizadores, usando essa informa&ccedil;&atilde;o para proveito pr&oacute;prio posteriormente.
    </p>
    <p>
        Muitos dos sistemas usam uma API (Application Programming Interface) que permite a utiliza&ccedil;&atilde;o do sistema por parte de aplica&ccedil;&otilde;es externas. Por exemplo, o <a href="https://www.paypal.com/pt/home">PayPal</a> tem uma API que permite que outras aplica&ccedil;&otilde;es o usem como m&eacute;todo de pagamento. No entanto, estas APIs s&atilde;o tamb&eacute;m bastante sujeitas a ataques <a href="#ddos">DDoS</a>, entre outros. Outro problema com a sua encripta&ccedil;&atilde;o &eacute; o baixo n&iacute;vel da complexidade das chaves de autentica&ccedil;&atilde;o usadas (muitas vezes s&atilde;o <i>pins</i> num&eacute;ricos com poucos digitos).
    </p>
    <hr>
    <h1 id="mobile-malware">Mobile Malware</h1>
    <p>Este g&eacute;nero de <i>malware</i> pode conseguir roubar a informa&ccedil;&atilde;o do dispositivo, inutilizar aplica&ccedil;&otilde;es. Estas amea&ccedil;as podem facilmente se espalhar atrav&eacute;s do <a href="https://www.bluetooth.com/">Bluetooth</a>.</p>
    <h2>Mobile Malware mais usados</h2>
    <ul>
        <li><b>Banking: </b>Captura dados de <i>logins</i> do usu&aacute;rio</li>
        <li><b>Ransomware: </b>Bloqueia ficheiros locais</li>
        <li><b>Spyware: </b>Controla a atividade do utilizador</li>
        <li><b>Adware: </b>Constantes publicidades</li>
        <li><b>MMS: </b>Usa mensagens para explorar falhas nas bibliotecas do android</li>
    </ul>
    <p>
        Com estes <i>malwares</i>, o utilizador corre o risco de ter dinheiro, informa&ccedil;&atilde;o pessoal/profissional/empresarial roubadas, podendo ser posteriormente vendidas no mercado negro da internet.
    </p>
</div>
<button id="goToTopButton" onclick="window.scrollTo(0,0)">
    <img src="images/arrow-up.png" alt="^" style="height: 100%; width: 100%;">
</button>
<footer>
    <div class="container">
        <div style="float: left">
            Ciberseguran&ccedil;a&emsp;&bullet;&emsp;<a href="index.html">In&iacute;cio</a>&emsp;&bullet;&emsp;Criado por <a href="https://github.com/RubenCGomes">R&uacute;ben Gomes</a> e <a href="https://github.com/TiagoRG">Tiago Garcia</a>
        </div>
        <div style="float: right">
            UAveiro&emsp;&bullet;&emsp;DETI
        </div>
    </div>
</footer>
<!-- Personal JS -->
<script src="js/topButton.js"></script>
</body>
</html>