<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Vulnerabilidades</title>
    <link rel="icon" href="images/favicon.jpeg">

    <!-- Bootstrap v5.3 navbar -->
    <link rel="canonical" href="https://getbootstrap.com/docs/5.3/examples/headers/">
    <!-- Bootstrap stylesheet -->
    <link rel="stylesheet" href="css/bootstrap-header.min.css">
    <!-- jQuery library -->
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.3/jquery.min.js"></script>
    <!-- Bootstrap JavaScript -->
    <script src="http://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>
    <script src="js/bootstrap.bundle.min.js"></script>

    <!-- Personal Styles -->
    <link rel="stylesheet" href="css/style.css">
</head>

<body>
<nav class="p-3 text-bg-dark">
    <div class="container">
        <div class="d-flex flex-wrap align-items-center justify-content-center justify-content-lg-start">
            <ul class="nav col-12 col-lg-auto me-lg-auto mb-2 justify-content-center mb-md-0">
                <li><a href="index.html" class="nav-link px-2 text-white">In&iacute;cio</a></li>
                <li>
                    <div class="flex-shrink-0 dropdown">
                        <a href="#"  class="nav-link px-2 text-white dropdown-toggle" data-bs-toggle="dropdown" aria-expanded="false">
                            Amea&ccedil;as
                        </a>
                        <ul class="dropdown-menu text-small shadow">
                            <li><a class="dropdown-item" href="ameacas.html">Topo da p&aacute;gina</a></li>
                            <li><hr class="dropdown-divider"></li>
                            <li><a class="dropdown-item" href="ameacas.html#ameacas-ciberneticas">Amea&ccedil;as Cibern&eacute;ticas</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#guerras-ciberneticas">Guerras Cibern&eacute;ticas</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#internet-banking">Internet Banking</a></li>
                            <li><a class="dropdown-item" href="ameacas.html#mobile-malware">Mobile Malware</a></li>
                        </ul>
                    </div>
                </li>
                <li>
                    <div class="flex-shrink-0 dropdown">
                        <a href="#"  class="nav-link px-2 text-secondary dropdown-toggle" data-bs-toggle="dropdown" aria-expanded="false">
                            Vulnerabilidades
                        </a>
                        <ul class="dropdown-menu text-small shadow">
                            <li><a class="dropdown-item" href="vulnerabilidades.html">Topo da p&aacute;gina</a></li>
                            <li><hr class="dropdown-divider"></li>
                            <li><a class="dropdown-item" href="vulnerabilidades.html#analise-de-vulnerabilidades">An&aacute;lise de vulnerabilidades</a></li>
                            <li><a class="dropdown-item" href="vulnerabilidades.html#analise-de-evidencias">An&aacute;lise de evid&ecirc;ncias</a></li>
                        </ul>
                    </div>
                </li>
                <li><a href="solucoes.html" class="nav-link px-2 text-white">Solu&ccedil;&otilde;es de seguran&ccedil;a</a></li>
            </ul>

            <div class="text-end">
                <button class="btn btn-warning"> <a class="btn btn-warning" href="about.html" target="_blank"> About </a></button>
            </div>
        </div>
    </div>
</nav>
<div class="container body-content shadow">
    <h1 id="vulnerabilidades" class="page-title">Vulnerabilidades</h1>

    <hr>

    <h1 id="analise-de-vulnerabilidades">An&aacute;lise de vulnerabilidades</h1>
    <p>
        A an&aacute;lise de vulnerabilidades no papel da Ciberseguran&ccedil;a &eacute; muito importante. Sem ela, n&atilde;o existiria nenhuma melhoria no ramo de combate &agrave;s amea&ccedil;as cibern&eacute;ticas, pois sem desenvolvimento, n&atilde;o haveria m&eacute;todos de nos proteger dos diversos tipos de ataque que se conhecemos.
    </p>
    <p>
        Este t&oacute;pico &eacute; dividido em v&aacute;rios ramos, como a Digital Forensics, a Incident Response, entre outros.
    </p>

    <hr>

    <h2>Digital Forensics</h2>
    <p>
        A Digital Forensics &eacute;, como o nome indica, a forense digital, e &eacute; a obten&ccedil;&atilde;o e an&aacute;lise de dados de uma forma pura, sem quais quer tipos de distor&ccedil;&atilde;o e sem tend&ecirc;ncias para qualquer lado, de modo a reconstru&iacute;r o que se passou no passado com o sistema.
    </p>
    <p>
        Tem como objetivo examinar dados de sistemas, ativdidade de utilizadores do sistema, programas em execu&ccedil;&atilde;o, entre outras m&eacute;tricas que possam ajudar a determinar se est&aacute; a decorrer um ataque e quem est&aacute; por detr&aacute;s do ataque.
    </p>
    <p>
        Deve-se ter sempre em conta a preserva&ccedil;&atilde;o dos dados. Se o caso a ser estudado for levado a tribunal e se descobrir que os dados foram, de qualquer forma, manipulados, &eacute; o suficiente para a prova de esses mesmos dados ser completamente anulada, e at&eacute; mesmo levar o caso contra quem apresentou essa prova.
    </p>

    <h4>Digital Forensic Investigation (DFI)</h4>
    <p>
        Com a DFI, entra-se na parte judicial das investiga&ccedil;&otilde;es. É uma investiga&ccedil;&atilde;o mais especializada, pois devem-se usar m&eacute;todos e t&eacute;cnicas que permitam a que as evid&ecirc;ncias apresentadas possam ser admiss&iacute;veis num tribunal.
    </p>
    <p>
        O grande objetivo &eacute; chegar &agrave; causa ra&iacute;z do problema/evento e garantir com clareza que as evid&ecirc;ncias n&atilde;o foram manipuladas de forma alguma, n&atilde;o levantando quaisquer quest&otilde;es ou d&uacute;vidas.
    </p>
    <p>Deve ser realizado um DFI, por exemplo:</p>

    <ul>
        <li>Resposta a um incidente</li>
        <li>Investiga&ccedil;&otilde;es criminais</li>
        <li>Corrigir falhas de seguran&ccedil;a</li>
    </ul>

    <hr>

    <h2>M&eacute;todos de An&aacute;lise</h2>
    <p>
        Existem dois tipos conhecidos de m&eacute;todos de an&aacute;lise de evid&ecirc;ncias, o M&eacute;todo Tradicional e M&eacute;todo Vivo
    </p>

    <h4>M&eacute;todo Tradicional(<i>Post mortem</i>)</h4>
    <p>
        O m&eacute;todo tradicional consiste na an&aacute;lise de evid&ecirc;ncias com o sistema desligado, acedendo ao disco num modo inalter&aacute;vel(<i>read-only</i>), e examinar, por exemplo:
    </p>
    <ul>
        <li>Logs do sistema</li>
        <li>E-mails</li>
        <li>Ficheiros</li>
        <li>Metadados</li>
    </ul>

    <h4>M&eacute;todo Vivo (<i>Live forensic</i>)</h4>
    <p>
        O m&eacute;todo vivo resulta da an&aacute;lise da m&aacute;quina, com a mesma ligada. Pode ser usado como prova um <i>screenshot</i> da m&aacute;quina. No caso de ser necess&aacute;rio examinar um disco, pode demorar algum tempo, especialmente se for de grande capacidade de armazenamento.
    </p>

    <hr>

    <h2>Incident Response</h2>
    <p>
        Incident Response(resposta ao incidente) &eacute; o procedimento que um sujeito ou, nomeadamente uma empresa toma para que se prepare, detete, contenha e recupere de uma eventual perda de dados.
    </p>
    <p>
        Esta &eacute; bastante importante em empresas para minimizar os danos eventuais de uma invas&atilde;o de dados, ou seja, n&atilde;o haver perda de dados e, at&eacute; mesmo, impedir que a mesma aconte&ccedil;a.
    </p>
    <p>
        Existem v&aacute;rias equipas espec&iacute;ficas para cada tipo de invas&atilde;o, como <i>Computer Incident Response Teams</i> (CIRTs), <i>Computer Emergency Response Teams</i> (CERTs), entre outras.
    </p>
    <h4>Threat Intelligence</h4>
    <p>
        A Threat Intelligence baseia-se na obten&ccedil;&atilde;o e an&aacute;lise de informa&ccedil;&otilde;es que ajudem a identificar poss&iacute;veis ataques. Esta vem com o benef&iacute;cio de ter uma seguran&ccedil;a proativa, ou seja, evitar qualquer tipo de amea&ccedil;as a uma empresa.
    </p>
    <p>O seguinte <a href="https://miro.medium.com/max/720/1*l9ccExnOaaC5PBWW_myW9w.webp">esquema</a> demonstra no que constitui uma Kill Chain:</p>

    <div class="image-w-text">
        <img src="images/cyber_kill_chain.png" class="center-image">
        <p>As 7 fases de um ataque cibern&eacute;tico</p>
    </div>

    <p>
        Tamb&eacute;m &eacute; importante mencionar as in&uacute;meras organiza&ccedil;&otilde;es que ajudam e facilitam o combate aos ataques cibern&eacute;ticos, sendo a mais destacada a MITRE ATT&CK.
    </p>
    <p>
        A MITRE ATT&CK &eacute; uma organiza&ccedil;&atilde;o focada na obten&ccedil;&atilde;o de informa&ccedil;&otilde;es de ciberataques apenas por observa&ccedil;&atilde;o do que acontece no mundo digital. É conhecida por ter uma vasta base de dados de ataques com informa&ccedil;&otilde;es de quase todos os ataques que aconteceram.
    </p>
    <p>
        Al&eacute;m de identificar os problemas, tamb&eacute;m disponibiliza solu&ccedil;&otilde;es para os mesmos, tudo isto sem qualquer custo tanto para uso pessoal como para uso empresarial. Isto obviamente refor&ccedil;a a ideia de colabora&ccedil;&atilde;o, que &eacute; bastante importante no ramo da inform&aacute;tica.
    </p>

    <h4>Ordem de Volatilidade</h4>
    <p>
        É muito importante ter em conta a ordem de volatilidade dos ficheiros criados por um sistema, pois devemos come&ccedil;ar sempre pelos ficheiros que est&atilde;o mais em contacto com o sistema (como ficheiros <i>cache</i>, <i>RAM</i>, etc.). A ordem por base no tempo em que est&atilde;o dispon&iacute;veis e acess&iacute;veis &eacute;, respetivamente, pela seguinte ordem:
    </p>
    <ol>
        <li>Ficheiros cache</li>
        <li>Mem&oacute;ria(RAM)</li>
        <li>Estado da rede</li>
        <li>Processos ativos</li>
        <li>Armazenamento</li>
        <li>Backups / C&oacute;pias de Seguran&ccedil;a</li>
        <li>DVD's ou impress&otilde;es</li>
    </ol>
    <p>
        A seguinte ordem &eacute; importante pelo facto de ao examinar um sistema, &eacute; preciso ter precis&atilde;o para encontrar a origem do problema, e na maioria dos casos essas evid&ecirc;ncias est&atilde;o na mem&oacute;ria gerada pelo sistema no instante em que ocorre o ataque, sendo esse o foco principal de um investigador.
    </p>

    <hr>

    <h1 id="analise-de-evidencias">An&aacute;lise de evid&ecirc;ncias</h1>

    <p>
        A an&aacute;lise de evid&ecirc;ncias &eacute; muito importante para o desenvolvimento de m&eacute;todos eficazes para combate a <i>malwares</i>, pois permite-nos examinar m&aacute;quinas afetadas por qualquer tipo de amea&ccedil;a. Estas podem ser, por exemplo:
    </p>
    <ul>
        <li>Malware</li>
        <li>Spyware</li>
        <li>Trojans</li>
        <li>Ransomware</li>
    </ul>

    <hr>

    <h2>Vulnerabilidades e como combat&ecirc;-las</h2>
    <p>
        Quando se fala em vulnerabilidades, refere-se a uma poss&iacute;vel falha num sistema que, a partir da mesma, pode ser comprometido o sistema, o utilizador ou uma empresa. Deve ser encarada como algo de alta prioridade, e deve ser resolvida o qu&atilde;o antes poss&iacute;vel, antes que ocorra algo inesperado. Por este motivo deve sempre existir a identifica&ccedil;&atilde;o, an&aacute;lise e retifica&ccedil;&atilde;o de vulnerabilidades.
    </p>
    <p>
        Como forma de ajuda a combater vulnerabilidades, existem v&aacute;rios <i>websites</i> com as vulnerabilidades mais comuns, e todas as informa&ccedil;&otilde;es necess&aacute;rias para poder saber a sua origem e como combat&ecirc;-las.
    </p>

    <h4>Common Vulnerabilities and Exposures (CVE)</h4>
    <p>
        A <a href="https://www.cve.org/">CVE</a> &eacute; um projeto da MITRE, cujo intuito &eacute; identificar, definir e catalogar as v&aacute;rias vulnerabilidades que existem no mundo digital. Estas amea&ccedil;as s&atilde;o sempre publicadas por parceiros da pr&oacute;pria <a href="https://www.cve.org/">CVE</a>, obtendo assim uma consist&ecirc;ncia nas descri&ccedil;&otilde;es das vulnerabilidades, para quem desejar explorar m&uacute;ltiplas vulnerabilidades e n&atilde;o ter muitos conflitos com as explica&ccedil;&otilde;es das mesmas.
    </p>

    <h4>Common Vulnerability Scoring System (CVSS)</h4>
    <p>
        A <a href="https://www.first.org/cvss/">CVSS</a> &eacute; um sistema que atribui a cada vulnerabilidade um grau de gravidade. Este &eacute; classificado do seguinte modo:
    </p>
    <div class="table-w-text">
        <table class="table">
            <tr>
                <th>Severity</th>
                <th>Base Score Range</th>
            </tr>
            <tr>
                <td>None</td>
                <td>0.0</td>
            </tr>
            <tr>
                <td>Low</td>
                <td>0.1 - 3.9</td>
            </tr>
            <tr>
                <td>Medium</td>
                <td>4.0 - 6.9</td>
            </tr>
            <tr>
                <td>High</td>
                <td>7.0 - 8.9</td>
            </tr>
            <tr>
                <td>Critical</td>
                <td>9.0 - 10.0</td>
            </tr>
        </table>
        <p>
            A tabela acima representa os graus de gravidade na <a href="https://nvd.nist.gov/vuln-metrics/cvss">classifica&ccedil;&atilde;o CVSS</a>
        </p>
    </div>

    <br>

    <p>
        Apenas s&atilde;o usados valores definitivos, que significa que n&atilde;o vai existir mudan&ccedil;a de valores para uma vulnerabilidade. Da&iacute; surgir a import&acirc;ncia de uma calculadora capaz de medir com precis&atilde;o o grau de gravidade de uma vulnerabilidade. Se a mesma se agravar, &eacute; criado um novo cat&aacute;logo com a nova amea&ccedil;a.
    </p>

    <h4>Common Weakness and Enumeration (CWE)</h4>
    <p>
        A <a href="https://cwe.mitre.org/">CWE</a> &eacute; outro projeto da MITRE, que lista todos os tipos de fraquezas de <i>software</i> e <i>hardware</i> comuns. Uma fraqueza &eacute; uma condi&ccedil;&atilde;o num <i>software</i>, <i>hardware</i>, <i>firmware</i> ou servi&ccedil;o que pode vir a introduzir uma vulnerabilidade a partir delas.
    </p>
    <p>
        O grande objetivo da <a href="https://cwe.mitre.org/">CWE</a> &eacute; parar as vulnerabilidades na sua ra&iacute;z, educando qualquer pessoa que trabalha no ramo da inform&aacute;tica, de modo a evitar erros comuns e contribuir para um espa&ccedil;o mais seguro numa empresa.
    </p>

    <h4 id="owasp-zap">Open Web Application Security Project (OWASP)</h4>
    <p>
        O <a href="https://owasp.org/">OWASP</a> &eacute; uma funda&ccedil;&atilde;o open-source com o intuito de melhorar a seguran&ccedil;a de <i>software</i> no geral, ensinando pessoas pelo mundo todo para existir uma <i>web</i> mais segura.
    </p>
    <p>
        Dentro desta funda&ccedil;&atilde;o, foi criada um projeto bastante importante no mundo
        cibern&eacute;tico, o <a href="https://owasp.org/www-project-top-ten/">OWASP Top Ten</a>. Este projeto consiste em, no final de cada ano, organizar um <i>top 10</i> das amea&ccedil;as mais comuns nesse mesmo ano. É feito sempre uma compara&ccedil;&atilde;o com anos anteriores para verificar as mudan&ccedil;as e melhorias que aconteceram. Ao ser realizada a compara&ccedil;&atilde;o, consegue-se saber se houve melhorias face ao combate de vulnerabilidades anteriores, as novas vulnerabilidades introduzidas e uma breve explica&ccedil;&atilde;o de cada uma delas.
    </p>
    <p>
        No seguinte <a href="https://owasp.org/www-project-top-ten/assets/images/mapping.png">esquema</a>, est&aacute; representada a compara&ccedil;&atilde;o das vulnerabilidades do ano 2017, e do ano 2021:
    </p>

    <div class="image-w-text">
        <img src="images/top10-2021.png" class="center-image">
        <p>Compara&ccedil;&atilde;o das amea&ccedil;as mais comuns entre 2017 e 2021</p>
    </div>

    <hr>

    <h2>Softwares usados para an&aacute;lises</h2>
    <p>
        Para poder examinar e tirar conclus&otilde;es de anomalias nos sistemas, &eacute; necess&aacute;rio utilizar ‘software’ dedicado para este tipo de problemas. Os <i>softwares</i> mais utilizados s&atilde;o o <a href="https://www.autopsy.com/">Autopsy</a>, o <a href="https://www.zaproxy.org/">OWASP-ZAP</a>, e o <a href="https://www.docker.com/">Docker</a>.
    </p>
    <p>
        Tamb&eacute;m &eacute; importante referir que para examinar discos e outras unidades de mem&oacute;ria, &eacute; necess&aacute;rio usar uma m&aacute;quina virtual <a href="https://www.kali.org/get-kali/">Kali</a>.
    </p>

    <h4 id="kali">Kali</h4>
    <p>
        O <a href="https://www.kali.org/get-kali/">Kali</a> &eacute; um sistema operativo Linux de base Debian. É usada especificamente para an&aacute;lise de vulnerabilidades, invas&atilde;o de redes, entre outros fins de forense. No <i>website</i> oficial existem v&aacute;rias op&ccedil;&otilde;es de <i>download</i> do <a href="https://www.kali.org/get-kali/">Kali</a>. Uma das mais utilizadas para an&aacute;lise de m&aacute;quinas &eacute; a <i>Live Boot</i>.
    </p>
    <p>
        A <i>Live Boot</i> consiste num sistema operativo tempor&aacute;rio e inalter&aacute;vel, ou seja, ao reiniciar ou desligar, volta &agrave;s defini&ccedil;&otilde;es default. Como n&atilde;o se pode fazer altera&ccedil;&otilde;es definitivas na m&aacute;quina, ela tem de estar pr&eacute;-definida com os programas necess&aacute;rios para qualquer tipo de an&aacute;lise. Por ser um sistema inalter&aacute;vel, tem a vantagem de ser poss&iacute;vel mexer nas evid&ecirc;ncias sem correr o risco de alterar as mesmas, algo que invalidaria automaticamente as provas.
    </p>
    <p>
        Por ser um sistema de base Linux, grande parte dos sistemas de ficheiros s&atilde;o acess&iacute;veis, algo que n&atilde;o &eacute; poss&iacute;vel num sistema Windows.
    </p>
    <p>
        Existe tamb&eacute;m a possibilidade de usar o <a href="https://www.kali.org/get-kali/">Kali</a> em m&aacute;quina virtual, usando um disco virtual, que significa que guarda todas as altera&ccedil;&otilde;es como um computador faria. Este tipo de m&aacute;quina &eacute; usada para explorar vulnerabilidades, por exemplo, em redes.
    </p>
    <p>
        Estas ferramentas devem ser usadas explicitamente com o consentimento total da v&iacute;tima, sendo estritamente proibido realizar um ataque n&atilde;o autorizado a qualquer empresa ou indiv&iacute;duo. S&atilde;o apenas ferramentas para fundos de educa&ccedil;&atilde;o.
    </p>

    <h4>Autopsy</h4>
    <p>
        O <a href="https://www.autopsy.com/">Autopsy</a> &eacute; uma aplica&ccedil;&atilde;o open-source que &eacute; capaz de analisar quase todos os tipos de discos, e foi escrita em Java. Esta usa <i>plugins</i> feitos pela comunidade para uma experi&ecirc;ncia customiz&aacute;vel para cada utilizador, permitindo assim uma livre escolha dependendo das necessidades de cada pessoa.
    </p>
    <p>Esta aplica&ccedil;&atilde;o &eacute; focada em v&aacute;rios campos, como, por exemplo:</p>
    <ul>
        <li>Pesquisas em Universidades/Academias</li>
        <li>Investiga&ccedil;&otilde;es em empresas</li>
        <li>Governo e Órg&atilde;os militares</li>
        <li>Investiga&ccedil;&otilde;es na pol&iacute;cia</li>
    </ul>
    <p>
        A grande vantagem de usar o <a href="https://www.autopsy.com/">Autopsy</a> ao inv&eacute;s de usar um sistema <a href="https://www.kali.org/get-kali/">Kali</a> por <i>Live Boot</i>, &eacute; que pode-se analisar unidades de disco diretamente a partir do sistema operativo principal, aumentando significamente o desempenho da an&aacute;lise, pois n&atilde;o se usa uma <i>pen</i> ou uma m&aacute;quina virtual para usar o sistema operativo.
    </p>
    <h4>OWASP - Zed Attack Proxy (OWASP-ZAP)</h4>
    <p>
        A <a href="https://www.zaproxy.org/">OWASP-ZAP</a> &eacute; uma aplica&ccedil;&atilde;o <i>open-source</i> desenvolvida pela OWASP, com o objetivo de explorar vulnerabilidades num <i>website</i>. O programa vem com in&uacute;meras ferramentas de <i>Penetration Testing</i>, para detetar o m&aacute;ximo de vulnerabiliades poss&iacute;veis.
    </p>
    <p>Esta aplica&ccedil;&atilde;o tem como vantagens:</p>
    <ul>
        <li>Ser reutiliz&aacute;vel, sendo capaz de guardar reports</li>
        <li>Bom para iniciantes</li>
        <li>É gr&aacute;tis</li>
    </ul>
    <p>
        Por outro lado, n&atilde;o &eacute; a ferramenta mais pr&aacute;tica de usar em empresas, pelo facto de ser <i>open-source</i> e n&atilde;o ter tanta privacidade como outras ferramentas pagas.
    </p>
    <p>
        É recomendado pela <a href="https://www.zaproxy.org/">OWASP-ZAP</a> o uso desta aplica&ccedil;&atilde;o juntamente com o <a href="https://www.docker.com/">Docker</a>, para a automatiza&ccedil;&atilde;o das ferramentas existentes no programa.
    </p>
    <p>
        Tamb&eacute;m &eacute; importante referir o projeto Juice Shop, que consiste numa aplica&ccedil;&atilde;o escrita em JavaScript e que simula uma loja gen&eacute;rica de v&aacute;rios produtos, que cont&eacute;m uma s&eacute;rie de vulnerabilidades.
    </p>
    <p>
        É aconselhado usar a imagem deste projeto no <a href="https://www.docker.com/">Docker</a>, para a explora&ccedil;&atilde;o dos erros ser efetuada local e eficientemente. Estes erros t&ecirc;m v&aacute;rios graus de dificuldade de serem explorados, e &agrave; medida que se descobre os erros, eles v&atilde;o sendo guardados num ficheiro log. que cont&eacute;m o que j&aacute; foi descoberto pelo utilizador.
    </p>

    <h4>Docker</h4>
    <p>
        O <a href="https://www.docker.com/">Docker</a> &eacute; um programa usado para desenvolver, enviar e correr aplica&ccedil;&otilde;es. Desta forma, pode-se criar v&aacute;rios <i>containers</i> para correr ou enviar qualquer tipo de aplica&ccedil;&atilde;o num espa&ccedil;o isolado. Tem a vantagem de poder ter v&aacute;rias aplica&ccedil;&otilde;es a correr localmente no mesmo sistema sem consumir muito hardware, que &eacute; um grande benef&iacute;cio na &aacute;rea da ciberseguran&ccedil;a, pois &eacute; usado v&aacute;rios programas ao mesmo tempo.
    </p>
    <p>No seguinte <a href="https://docs.docker.com/engine/images/architecture.svg">esquema</a> &eacute; apresentado que mostra a l&oacute;gica por detr&aacute;s do <a href="https://www.docker.com/">Docker</a>:</p>

    <div class="image-w-text">
        <img src="images/docker-scheme.png" class="center-image">
        <p>Esquema que representa o funcionamento do <a href="https://www.docker.com/">Docker</a></p>
    </div>

    <p>
        Os containers s&atilde;o feitos e funcionam em base de imagens, semelhante a um sistema operativo. Estas s&atilde;o normalmente imagens de outras imagens, apenas com algumas modifica&ccedil;&otilde;es feitas.
    </p>
    <p>
        Uma imagem bastante conhecida neste campo &eacute; a imagem do Juice Shop, um projeto referido na Se&ccedil;&atilde;o <a href="https://www.zaproxy.org/">OWASP-ZAP</a>. Com o <a href="https://www.docker.com/">Docker</a> e a imagem deste projeto, podemos criar um container que vai correr o <i>site</i>, localmente. A grande vantagem de correr ficheiros localmente &eacute; que pode-se fazer os testes sem qualquer problema, &eacute; poss&iacute;vel fazer certos tipos de ataque que na Internet seriam considerados ilegais mas que s&atilde;o, sem d&uacute;vida alguma, cruciais para o bom funcionamento de um <i>website</i>.
    </p>

</div>
<button id="goToTopButton" onclick="window.scrollTo(0,0)">
    <img src="images/arrow-up.png" alt="^" style="height: 100%; width: 100%;">
</button>
<footer>
    <div class="container">
        <div style="float: left" class="">
            Ciberseguran&ccedil;a&emsp;&bullet;&emsp;<a href="index.html">In&iacute;cio</a>&emsp;&bullet;&emsp;Criado por <a href="https://github.com/RubenCGomes">R&uacute;ben Gomes</a> e <a href="https://github.com/TiagoRG">Tiago Garcia</a>
        </div>
        <div style="float: right">
            UAveiro&emsp;&bullet;&emsp;DETI
        </div>
    </div>
</footer>
<!-- Personal JS -->
<script src="js/topButton.js"></script>
</body>
</html>